In [1]:
import pandas as pd
import numpy as np

In [2]:
date = pd.read_csv('../../../data/orders.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
# convert date object to date datetime64

date['date'] = pd.to_datetime(date['date'])

In [7]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

**1. Extract Year**

In [9]:
date['year'] = date['date'].dt.year
date.head()

        date  product_id  city_id  orders  year
0 2019-12-10        5628       25       3  2019
1 2018-08-15        3646       14     157  2018
2 2018-10-23        1859       25       1  2018
3 2019-08-17        7292       25       1  2019
4 2019-01-06        4344       25       3  2019

**2. Extract Month**

In [12]:
date['month'] = date['date'].dt.month
# date.head()
# Month name

date['month_name']= date['date'].dt.month_name()
date.head()

        date  product_id  city_id  orders  year  month month_name
0 2019-12-10        5628       25       3  2019     12   December
1 2018-08-15        3646       14     157  2018      8     August
2 2018-10-23        1859       25       1  2018     10    October
3 2019-08-17        7292       25       1  2019      8     August
4 2019-01-06        4344       25       3  2019      1    January

**3. Extract Day**

In [20]:
date['day'] = date['date'].dt.day
# date.head()

# day of week 

date['day_of_week'] = date['date'].dt.dayofweek
# date['day_of_week'] = date['date'].dt.day_of_week
# date.head()

# day of week - name

date['dow_name'] = date['date'].dt.day_name()
date.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_of_week,dow_name
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday

In [23]:
# is weekend ?

date['weekend'] = np.where(date['dow_name'].isin(['Saturday','Sunday']),1,0)
date.head()

,date,product_id,city_id,orders,year,month,month_name,day,day_of_week,dow_name,weekend
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1

In [30]:
# week 

date['week'] = date['date'].dt.isocalendar().week
# date.head()

# quarter

date['quarter'] = date['date'].dt.quarter

date.drop(columns=['product_id','city_id','orders']).head()

,date,year,month,month_name,day,day_of_week,dow_name,weekend,week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

**Extract Time Elapsed between Dates**

In [32]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 11, 5, 22, 21, 31, 49876)

In [33]:
today-date['date']

0     2157 days 22:21:31.049876
1     2639 days 22:21:31.049876
2     2570 days 22:21:31.049876
3     2272 days 22:21:31.049876
4     2495 days 22:21:31.049876
                 ...
995   2585 days 22:21:31.049876
996   2526 days 22:21:31.049876
997   2374 days 22:21:31.049876
998   2439 days 22:21:31.049876
999   2213 days 22:21:31.049876
Name: date, Length: 1000, dtype: timedelta64[ns]

In [35]:
(today-date['date']).dt.days

0      2157
1      2639
2      2570
3      2272
4      2495
       ...
995    2585
996    2526
997    2374
998    2439
999    2213
Name: date, Length: 1000, dtype: int64

In [39]:
# Months Passed

date['months_diff'] = ((today.year - date['date'].dt.year) * 12 +
                     (today.month - date['date'].dt.month))

date.drop(columns=['product_id','city_id','orders']).head()

,date,year,month,month_name,day,day_of_week,dow_name,weekend,week,quarter,months_diff
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,71
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,87
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,85
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,75
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,82